CSI API ETABS v1
cCaseStaticNonlinearStaged.GetStageDefinitions Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetStageDefinitions(
	string Name,
	ref int NumberStages,
	ref int[] Duration,
	ref string[] Comment
)
Function GetStageDefinitions (
	Name As String,
	ByRef NumberStages As Integer,
	ByRef Duration As Integer(),
	ByRef Comment As String()
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim NumberStages As Integer
Dim Duration As Integer()
Dim Comment As String()
Dim returnValue As Integer
returnValue = instance.GetStageDefinitions(Name,
	NumberStages, Duration, Comment)
int GetStageDefinitions(
	String^ Name,
	int% NumberStages,
	array<int>^% Duration,
	array<String^>^% Comment
)
abstract GetStageDefinitions :
        Name : string *
        NumberStages : int byref *
        Duration : int[] byref *
        Comment : string[] byref -> int
Parameters
Name
Type: System.String
NumberStages
Type: System.Int32
Duration
Type: System.Int32[]
Comment
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace